; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	thermograph1 - mode
	image2 - mode
	infrared3 - mode
	spectrograph0 - mode
	Star2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star0 - direction
	Star7 - direction
	Star6 - direction
	Star1 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph1)
	(supports instrument1 image2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument2 image2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star7)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star7)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star6)
	(supports instrument5 image2)
	(supports instrument5 thermograph1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star6)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon15)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star6)
	(supports instrument7 spectrograph0)
	(supports instrument7 image2)
	(calibration_target instrument7 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon16)
)
(:goal (and
	(pointing satellite1 Star1)
	(have_image Star8 infrared3)
	(have_image Planet9 spectrograph0)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon12 spectrograph0)
	(have_image Phenomenon13 infrared3)
	(have_image Planet14 infrared3)
	(have_image Phenomenon15 thermograph1)
	(have_image Phenomenon16 spectrograph0)
))

)

; plan
1. (turn_to satellite1 star1 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star1)
   goals met: 1 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 10
3. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 1 of 10
4. (turn_to satellite1 planet14 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet14)
   goals met: 0 of 10
5. (take_image satellite1 planet14 instrument3 infrared3)
   added: (have_image planet14 infrared3)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon13 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon13 instrument3 infrared3)
   added: (have_image phenomenon13 infrared3)
   goals met: 2 of 10
8. (turn_to satellite1 phenomenon10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 10
9. (turn_to satellite0 star0 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star0)
   goals met: 2 of 10
10. (take_image satellite1 phenomenon10 instrument3 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 3 of 10
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 10
12. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 3 of 10
13. (turn_to satellite0 phenomenon11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 10
14. (take_image satellite0 phenomenon11 instrument1 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 4 of 10
15. (turn_to satellite0 phenomenon12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 10
16. (take_image satellite0 phenomenon12 instrument1 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 5 of 10
17. (turn_to satellite0 phenomenon15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon15)
   goals met: 5 of 10
18. (take_image satellite0 phenomenon15 instrument1 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 6 of 10
19. (turn_to satellite0 phenomenon16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon16)
   goals met: 6 of 10
20. (take_image satellite0 phenomenon16 instrument1 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 7 of 10
21. (turn_to satellite0 planet9 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet9)
   goals met: 7 of 10
22. (take_image satellite0 planet9 instrument1 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 8 of 10
23. (turn_to satellite1 star8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star8)
   goals met: 8 of 10
24. (take_image satellite1 star8 instrument3 infrared3)
   added: (have_image star8 infrared3)
   goals met: 9 of 10
25. (turn_to satellite1 star1 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star1)
   goals met: 10 of 10
